import React from "react";
import {
  Button,
  Grid,
  InputAdornment,
  TextField,
  Typography,
} from "@mui/material";
import { Box, Container } from "@mui/system";
import avatar from "../../assets/images/avatar.png";
import img from "../../assets/images/img1.png";
// eslint-disable-next-line no-unused-vars
import { Fancybox } from "@fancyapps/ui";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";

const LiveDetails = () => {
  return (
    <seciton>
      <Container maxWidth="xl">
        <Box borderBottom="1px solid #00000010" pb={3} mb={3}>
          <div className="d-flex">
            <img src={avatar} alt="" />
            <Typography ml={2} variant="body2">
              Имя Пользователя
            </Typography>
          </div>
          <Typography
            variant="h5"
            mt={2}
            mb={2}
            fontWeight="700"
            lineHeight="29px"
          >
            Обзор новой поставки товаров в честь распродажи 20-26 июня, розыгрыш
            промокодов на скидку 12%{" "}
          </Typography>
          <Typography variant="body2" fontWeight="400">
            Покажем картины, которые мы подготовили для МЕГА распродажи{" "}
          </Typography>
        </Box>
        <Grid container spacing={3}>
          <Grid item xs={4} display="flex" flexDirection="column" rowGap="16px">
            <Box
              display="flex"
              justifyContent="center"
              flexDirection="column"
              alignItems="center"
            >
              <Typography variant="body2" fontWeight="700" mb={2}>
                11 товаров на стриме
              </Typography>
              <div className="d-flex">
                <svg
                  width="23"
                  height="24"
                  viewBox="0 0 23 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M11.5 0.375C13.1172 0.375 14.5547 1.31836 15.2734 2.71094C16.7559 2.2168 18.418 2.57617 19.6309 3.74414C20.7988 4.91211 21.1133 6.61914 20.6641 8.10156C22.0566 8.82031 23 10.2578 23 11.875C23 13.5371 22.0566 14.9746 20.6641 15.6934C21.1582 17.1758 20.7988 18.8379 19.6309 20.0059C18.418 21.1738 16.7559 21.5332 15.2734 21.084C14.5547 22.4766 13.1172 23.375 11.5 23.375C9.83789 23.375 8.40039 22.4766 7.68164 21.084C6.19922 21.5332 4.53711 21.1738 3.32422 20.0059C2.15625 18.8379 1.8418 17.1758 2.29102 15.6934C0.898438 14.9746 0 13.5371 0 11.875C0 10.2578 0.898438 8.82031 2.29102 8.10156C1.79688 6.61914 2.15625 4.91211 3.32422 3.74414C4.53711 2.57617 6.19922 2.2168 7.68164 2.71094C8.40039 1.31836 9.83789 0.375 11.5 0.375ZM8.625 10.4375C9.38867 10.4375 10.0625 9.80859 10.0625 9C10.0625 8.23633 9.38867 7.5625 8.625 7.5625C7.81641 7.5625 7.1875 8.23633 7.1875 9C7.1875 9.80859 7.81641 10.4375 8.625 10.4375ZM14.375 13.3125C13.5664 13.3125 12.9375 13.9863 12.9375 14.75C12.9375 15.5586 13.5664 16.1875 14.375 16.1875C15.1387 16.1875 15.8125 15.5586 15.8125 14.75C15.8125 13.9863 15.1387 13.3125 14.375 13.3125ZM15.0938 9.76367C15.543 9.35938 15.543 8.68555 15.0938 8.23633C14.6895 7.83203 14.0156 7.83203 13.6113 8.23633L7.86133 13.9863C7.41211 14.4355 7.41211 15.1094 7.86133 15.5137C8.26562 15.9629 8.93945 15.9629 9.34375 15.5137L15.0938 9.76367Z"
                    fill="#8C8C8C"
                  />
                </svg>
                <Typography
                  fontSize="12px"
                  maxWidth="175px"
                  lineHeight="15px"
                  color="#8C8C8C"
                  ml={1}
                >
                  Скидки на товары действуют только для зрителей эфира.
                </Typography>
              </div>
            </Box>
            {Array.from(Array(3).keys()).map((item) => (
              <Product />
            ))}
          </Grid>
          <Grid item xs={4}>
            <video
              style={{
                borderRadius: "16px",
              }}
              width="404"
              height="100%"
              data-fancybox="gallery"
              data-src="movie.mp4"
              controls
            >
              <source src="movie.mp4" type="video/mp4" />
              <source src="movie.ogg" type="video/ogg" />
              Your browser does not support the video tag.
            </video>
          </Grid>
          <Grid item xs={4}>
            <Box
              sx={{
                // maxHeight: "",
                height: "692px",
                overflow: "hidden",
                background: "#FFFFFF",
                boxShadow: "0px 4px 16px rgba(0, 0, 0, 0.17)",
                borderRadius: 2,
                p: 2,
                display: "flex",
                justifyContent: "space-between",
                flexDirection: "column",

                "& button": {
                  border: "none",
                  background: "none",
                },
              }}
            >
              <Box display="flex" columnGap="8px">
                <Box
                  display="flex"
                  width="fit-content"
                  p="6px"
                  borderRadius={1}
                  color="#FFF"
                  backgroundColor="var(--primary)"
                >
                  <Typography mr={1}> 14,2 к</Typography>
                  <FontAwesomeIcon icon="box" />
                </Box>
                <Box
                  display="flex"
                  width="fit-content"
                  p="6px"
                  borderRadius={1}
                  color="#000"
                  backgroundColor="#DCDCDC"
                >
                  <Typography mr={1}> 14,2 к</Typography>
                  <FontAwesomeIcon icon="eye" />
                </Box>
                <Box
                  display="flex"
                  width="fit-content"
                  p="6px"
                  borderRadius={1}
                  color="var(--primary)"
                  border="1px solid var(--primary)"
                >
                  <Typography mr={1}> 14,2 к</Typography>
                  <FontAwesomeIcon icon="thumbs-up" />
                </Box>
                {/* <Button
                  sx={{ p: "6px!important", fontSize: 14 }}
                  color="primary"
                  variant="contained"
                >
                  Поделиться <FontAwesomeIcon icon="share-from-square" />
                </Button> */}
              </Box>

              <Box>
                <Box mt={2} sx={{ opacity: "0.5" }}>
                  <Typography fontSize="12px" fontWeight="700">
                    Кто Написал:
                  </Typography>
                  <Typography fontSize="12px" mt={0.5} fontWeight="400">
                    На картинке, прикрепленной к этому анонсу изображены 3
                    предмета — сможете определить, что их объединяет? Если да,
                    подготовьтесь к вопросам посложнее на игре «Где логика?» с
                    Иваном Павленко —вашу смекалку ждёт серьезное, но весёлое
                    испытание! 13 июля в 20:00 🔔 Нажмите на колокольчик — мы
                    напомним о начале трансляции |
                  </Typography>
                </Box>
                <Box mt={2} sx={{ opacity: "0.7" }}>
                  <Typography fontSize="12px" fontWeight="700">
                    Кто Написал:
                  </Typography>
                  <Typography fontSize="12px" mt={0.5} fontWeight="400">
                    Текст сообщения
                  </Typography>
                </Box>
                <Box mt={2}>
                  <Typography fontSize="12px" fontWeight="700">
                    Кто Написал:
                  </Typography>
                  <Typography fontSize="12px" mt={0.5} fontWeight="400">
                    Текст сообщения
                  </Typography>
                </Box>
                <Box mt={2} mb={2}>
                  <Typography fontSize="12px" fontWeight="700">
                    Кто Написал:
                  </Typography>
                  <Typography fontSize="12px" mt={0.5} fontWeight="400">
                    На картинке, прикрепленной к этому анонсу изображены 3
                    предмета — сможете определить, что их объединяет? Если да,
                    подготовьтесь к вопросам посложнее на игре «Где логика?» с
                    Иваном Павленко —вашу смекалку ждёт серьезное, но весёлое
                    испытание! 13 июля в 20:00 🔔 Нажмите на колокольчик — мы
                    напомним о начале трансляции |
                  </Typography>
                </Box>
              </Box>

              <TextField
                required
                sx={{
                  p: 0,
                  boxShadow: "none!important",
                  height: "100%",
                  "& textarea": {
                    p: "0!important",
                  },
                }}
                InputProps={{
                  endAdornment: (
                    <button type="submit" aria-label="search">
                      <InputAdornment position="end">
                        <FontAwesomeIcon icon="paper-plane" />
                      </InputAdornment>
                    </button>
                  ),
                }}
                fullWidth
                name="comment"
                // value={formik.values.comment}
                // onChange={formik.handleChange}
                variant="outlined"
                placeholder="Текст комментария"
                multiline
              />
            </Box>
          </Grid>
        </Grid>
      </Container>
    </seciton>
  );
};

export default LiveDetails;

const Product = () => (
  <Box
    sx={{
      display: "flex",
      background: "#FFFFFF",
      border: "1px solid #C3C3C3",
      borderRadius: 1,
    }}
  >
    <img
      src={img}
      height="162px"
      width="216px"
      style={{ objectFit: "cover" }}
      alt=""
    />
    <Box
      width="60%"
      p="12px"
      flexDirection="column"
      display="flex"
      justifyContent="space-between"
    >
      <Box display="flex" justifyContent="space-between">
        <svg
          width="84"
          height="20"
          viewBox="0 0 84 20"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <rect width="84" height="20" rx="4" fill="#E32967" />
          <path
            d="M9 5.25C9.70312 5.25 10.3281 5.66016 10.6406 6.26562C11.2852 6.05078 12.0078 6.20703 12.5352 6.71484C13.043 7.22266 13.1797 7.96484 12.9844 8.60938C13.5898 8.92188 14 9.54688 14 10.25C14 10.9727 13.5898 11.5977 12.9844 11.9102C13.1992 12.5547 13.043 13.2773 12.5352 13.7852C12.0078 14.293 11.2852 14.4492 10.6406 14.2539C10.3281 14.8594 9.70312 15.25 9 15.25C8.27734 15.25 7.65234 14.8594 7.33984 14.2539C6.69531 14.4492 5.97266 14.293 5.44531 13.7852C4.9375 13.2773 4.80078 12.5547 4.99609 11.9102C4.39062 11.5977 4 10.9727 4 10.25C4 9.54688 4.39062 8.92188 4.99609 8.60938C4.78125 7.96484 4.9375 7.22266 5.44531 6.71484C5.97266 6.20703 6.69531 6.05078 7.33984 6.26562C7.65234 5.66016 8.27734 5.25 9 5.25ZM7.75 9.625C8.08203 9.625 8.375 9.35156 8.375 9C8.375 8.66797 8.08203 8.375 7.75 8.375C7.39844 8.375 7.125 8.66797 7.125 9C7.125 9.35156 7.39844 9.625 7.75 9.625ZM10.25 10.875C9.89844 10.875 9.625 11.168 9.625 11.5C9.625 11.8516 9.89844 12.125 10.25 12.125C10.582 12.125 10.875 11.8516 10.875 11.5C10.875 11.168 10.582 10.875 10.25 10.875ZM10.5625 9.33203C10.7578 9.15625 10.7578 8.86328 10.5625 8.66797C10.3867 8.49219 10.0938 8.49219 9.91797 8.66797L7.41797 11.168C7.22266 11.3633 7.22266 11.6562 7.41797 11.832C7.59375 12.0273 7.88672 12.0273 8.0625 11.832L10.5625 9.33203Z"
            fill="white"
          />
          <path
            d="M18.2486 15.7578V13.0696H18.728C18.8913 12.9323 19.044 12.737 19.1861 12.4837C19.3281 12.2304 19.4489 11.8883 19.5483 11.4574C19.6477 11.0265 19.7164 10.4737 19.7543 9.79901L19.9247 6.72727H24.4098V13.0696H25.2337V15.7472H24.1825V14H19.2997V15.7578H18.2486ZM20.0206 13.0696H23.3587V7.67188H20.919L20.8054 9.79901C20.7746 10.3127 20.7237 10.7744 20.6527 11.1839C20.584 11.5935 20.4953 11.9557 20.3864 12.2706C20.2798 12.5831 20.1579 12.8494 20.0206 13.0696ZM25.9208 14L25.9173 13.0803H26.1126C26.2641 13.0803 26.3907 13.0483 26.4925 12.9844C26.5967 12.9181 26.6819 12.8068 26.7482 12.6506C26.8145 12.4943 26.8654 12.2789 26.9009 12.0043C26.9364 11.7273 26.9625 11.3793 26.979 10.9602L27.0749 8.54545H30.8817V14H29.8413V9.46165H28.0586L27.9734 11.3153C27.9521 11.7652 27.9059 12.1581 27.8349 12.4943C27.7662 12.8305 27.6656 13.111 27.533 13.3359C27.4004 13.5585 27.23 13.7254 27.0217 13.8366C26.8133 13.9455 26.56 14 26.2617 14H25.9208ZM35.5506 14V9.45099H34.2438C33.9337 9.45099 33.6922 9.5232 33.5194 9.66761C33.3465 9.81203 33.2601 10.0014 33.2601 10.2358C33.2601 10.4678 33.3394 10.6548 33.498 10.7969C33.659 10.9366 33.8839 11.0064 34.1728 11.0064H35.8596V11.8658H34.1728C33.7703 11.8658 33.4223 11.7995 33.1287 11.6669C32.8375 11.532 32.6126 11.3414 32.454 11.0952C32.2978 10.849 32.2196 10.5578 32.2196 10.2216C32.2196 9.87831 32.3001 9.58239 32.4611 9.33381C32.6245 9.08286 32.8577 8.88873 33.1607 8.75142C33.4661 8.61411 33.8271 8.54545 34.2438 8.54545H36.5485V14H35.5506ZM31.9711 14L33.5087 11.2443H34.5953L33.0577 14H31.9711ZM40.2852 12.5582H41.3718C41.386 12.7808 41.4866 12.9524 41.6737 13.0732C41.863 13.1939 42.1081 13.2543 42.4087 13.2543C42.7141 13.2543 42.9746 13.1892 43.19 13.0589C43.4054 12.9264 43.5131 12.7216 43.5131 12.4446C43.5131 12.2789 43.4717 12.1345 43.3888 12.0114C43.3084 11.8859 43.1935 11.7888 43.0444 11.7202C42.8976 11.6515 42.7236 11.6172 42.5224 11.6172H41.6346V10.7827H42.5224C42.823 10.7827 43.0479 10.714 43.1971 10.5767C43.3462 10.4394 43.4208 10.2678 43.4208 10.0618C43.4208 9.83925 43.3403 9.66051 43.1793 9.52557C43.0207 9.38826 42.7994 9.3196 42.5153 9.3196C42.2264 9.3196 41.9862 9.38471 41.7944 9.51491C41.6026 9.64276 41.502 9.80848 41.4925 10.0121H40.4201C40.4272 9.70668 40.5195 9.43916 40.6971 9.20952C40.877 8.97751 41.1185 8.79759 41.4215 8.66974C41.7269 8.53954 42.0737 8.47443 42.462 8.47443C42.8668 8.47443 43.2172 8.53954 43.5131 8.66974C43.8091 8.79995 44.0375 8.97988 44.1985 9.20952C44.3619 9.43916 44.4435 9.70312 44.4435 10.0014C44.4435 10.3021 44.3536 10.5483 44.1737 10.7401C43.9961 10.9295 43.7641 11.0656 43.4776 11.1484V11.2053C43.6883 11.2195 43.8754 11.2834 44.0387 11.397C44.2021 11.5107 44.3299 11.661 44.4222 11.848C44.5146 12.035 44.5607 12.2469 44.5607 12.4837C44.5607 12.8175 44.4684 13.1063 44.2837 13.3501C44.1014 13.594 43.8481 13.7822 43.5238 13.9148C43.2018 14.045 42.8337 14.1101 42.4194 14.1101C42.0169 14.1101 41.6559 14.0473 41.3363 13.9219C41.0191 13.794 40.7669 13.6141 40.5799 13.3821C40.3952 13.1501 40.297 12.8755 40.2852 12.5582ZM45.6571 16.0455V8.54545H46.6941V9.42969H46.7828C46.8444 9.31605 46.9332 9.18466 47.0492 9.03551C47.1652 8.88636 47.3262 8.75616 47.5321 8.64489C47.7381 8.53125 48.0104 8.47443 48.3489 8.47443C48.7892 8.47443 49.1822 8.5857 49.5279 8.80824C49.8735 9.03078 50.1446 9.35156 50.3411 9.7706C50.54 10.1896 50.6394 10.6939 50.6394 11.2834C50.6394 11.8729 50.5411 12.3783 50.3446 12.7997C50.1481 13.2187 49.8783 13.5419 49.535 13.7692C49.1917 13.9941 48.7999 14.1065 48.3596 14.1065C48.0281 14.1065 47.757 14.0509 47.5463 13.9396C47.338 13.8284 47.1747 13.6982 47.0563 13.549C46.9379 13.3999 46.8468 13.2673 46.7828 13.1513H46.7189V16.0455H45.6571ZM46.6976 11.2727C46.6976 11.6562 46.7533 11.9924 46.8645 12.2812C46.9758 12.5701 47.1368 12.7962 47.3475 12.9595C47.5582 13.1205 47.8162 13.201 48.1216 13.201C48.4389 13.201 48.704 13.117 48.9171 12.9489C49.1301 12.7784 49.2911 12.5476 49.4 12.2564C49.5113 11.9652 49.5669 11.6373 49.5669 11.2727C49.5669 10.9129 49.5125 10.5897 49.4036 10.3033C49.2971 10.0168 49.1361 9.79072 48.9206 9.625C48.7076 9.45928 48.4412 9.37642 48.1216 9.37642C47.8139 9.37642 47.5534 9.45573 47.3404 9.61435C47.1297 9.77296 46.9699 9.99432 46.861 10.2784C46.7521 10.5625 46.6976 10.8939 46.6976 11.2727ZM52.8695 12.5121L55.2736 8.54545H56.4171V14H55.3766V10.0298L52.9831 14H51.829V8.54545H52.8695V12.5121ZM57.1681 9.46165V8.54545H61.7704V9.46165H59.9913V14H58.9544V9.46165H57.1681ZM64.9904 14.1101C64.453 14.1101 63.9902 13.9953 63.6019 13.7656C63.216 13.5336 62.9177 13.2081 62.707 12.7891C62.4987 12.3677 62.3945 11.8741 62.3945 11.3082C62.3945 10.7495 62.4987 10.2571 62.707 9.83097C62.9177 9.40483 63.2113 9.07221 63.5877 8.8331C63.9665 8.59399 64.4092 8.47443 64.9158 8.47443C65.2236 8.47443 65.5219 8.52533 65.8107 8.62713C66.0996 8.72893 66.3588 8.88873 66.5884 9.10653C66.8181 9.32434 66.9992 9.60724 67.1317 9.95526C67.2643 10.3009 67.3306 10.7211 67.3306 11.2159V11.5923H62.9947V10.7969H66.2901C66.2901 10.5175 66.2333 10.2701 66.1197 10.0547C66.006 9.83688 65.8462 9.66525 65.6403 9.53977C65.4367 9.4143 65.1976 9.35156 64.9229 9.35156C64.6246 9.35156 64.3642 9.42495 64.1417 9.57173C63.9215 9.71615 63.7511 9.90554 63.6303 10.1399C63.512 10.3719 63.4528 10.6241 63.4528 10.8963V11.5178C63.4528 11.8823 63.5167 12.1925 63.6445 12.4482C63.7747 12.7038 63.9558 12.8991 64.1879 13.0341C64.4199 13.1667 64.6909 13.233 65.0011 13.233C65.2023 13.233 65.3858 13.2045 65.5515 13.1477C65.7172 13.0885 65.8604 13.0009 65.9812 12.8849C66.1019 12.7689 66.1942 12.6257 66.2582 12.4553L67.2631 12.6364C67.1826 12.9323 67.0382 13.1915 66.8299 13.4141C66.6239 13.6342 66.3647 13.8059 66.0522 13.929C65.7421 14.0497 65.3881 14.1101 64.9904 14.1101ZM68.079 14L68.0755 13.0803H68.2708C68.4223 13.0803 68.5489 13.0483 68.6507 12.9844C68.7549 12.9181 68.8401 12.8068 68.9064 12.6506C68.9727 12.4943 69.0236 12.2789 69.0591 12.0043C69.0946 11.7273 69.1207 11.3793 69.1373 10.9602L69.2331 8.54545H73.04V14H71.9995V9.46165H70.2168L70.1316 11.3153C70.1103 11.7652 70.0641 12.1581 69.9931 12.4943C69.9244 12.8305 69.8238 13.111 69.6912 13.3359C69.5587 13.5585 69.3882 13.7254 69.1799 13.8366C68.9715 13.9455 68.7182 14 68.4199 14H68.079ZM77.7088 14V9.45099H76.402C76.0919 9.45099 75.8504 9.5232 75.6776 9.66761C75.5047 9.81203 75.4183 10.0014 75.4183 10.2358C75.4183 10.4678 75.4976 10.6548 75.6562 10.7969C75.8172 10.9366 76.0421 11.0064 76.331 11.0064H78.0178V11.8658H76.331C75.9285 11.8658 75.5805 11.7995 75.2869 11.6669C74.9957 11.532 74.7708 11.3414 74.6122 11.0952C74.456 10.849 74.3778 10.5578 74.3778 10.2216C74.3778 9.87831 74.4583 9.58239 74.6193 9.33381C74.7827 9.08286 75.0159 8.88873 75.3189 8.75142C75.6243 8.61411 75.9853 8.54545 76.402 8.54545H78.7067V14H77.7088ZM74.1293 14L75.6669 11.2443H76.7536L75.2159 14H74.1293Z"
            fill="white"
          />
        </svg>
        <Box
          sx={{
            padding: "4px",
            background: "#CE1A1A",
            borderRadius: "4px",
          }}
        >
          <Typography fontSize="10px" color="#FFF">
            1200
          </Typography>
        </Box>
      </Box>
      <Typography variant="body2" textDecoration="underline">
        Название товара
      </Typography>
      <Typography variant="body2" color="#00000050">
        Описание товара фывфывфывфывфывфывфывфывфывфывф...
      </Typography>
      <Box display="flex">
        <Typography
          variant="body2"
          sx={{
            textDecoration: "line-through",
          }}
        >
          1 000 c
        </Typography>
        <Typography
          variant="body2"
          fontWeight="700"
          ml={2}
          color="var(--primary)"
        >
          1 000 c
        </Typography>
      </Box>
    </Box>
  </Box>
);
